import React from "react";
import styled from "styled-components";
import FlexGrid from "../../elements/FlexGrid";

function MemberPolicy(props) {
  return (
    <>
      <Content is_column gap="0px">
        <Policy>
          제 1 조 (목적) <br />이 약관은 DALKING(이하 "갑"이라 한다)에서
          제공하는 인터넷 서비스(이하 "서비스"라 한다)를 이용하는 데 있어서
          회사와 서비스 이용자(이하 "회원"이라 한다)의 권리, 의무 및 책임사항을
          규정함을 목적으로 합니다.
          <br />
          <br />
          제2조 (약관의 정의 효력 및 변경) <br />
          1. 이 약관은 갑이 인터넷 서비스를 제공하는 사이트에 공시함으로써
          회원에게 효력을 발생합니다. <br />
          2. 갑은 운영상의 중요 사유가 있을 때 약관을 변경할 수 있으며 약관이
          변경된 경우에는 지체 없이 이를 공시합니다. <br />
          3. 약관의 내용이 변경, 삭제 또는 추가될 경우 갑은 지체 없이 홈페이지의
          초기화면에 그 적용일 8일 이전부터 적용일자 전일까지 홈페이지에
          공지합니다. <br />
          4. 이 약관에 동의하는 것은 정기적으로 사이트를 방문하여 약관의
          변경사항을 확인하는 것에 동의함을 의미합니다. 공지되어 변경된 약관에
          대한 정보를 알지 못해 발생하는 회원의 피해는 갑에서 책임지지 않습니다.{" "}
          <br />
          5. 회원은 변경된 약관에 동의하지 않을 경우 회원 탈퇴를 할 수 있습니다.
          <br />
          <br />
          제3조 (약관 외 준칙) <br />
          이 약관은 DALKING(이하 "갑"이라 한다)에서 제공하는 인터넷 서비스(이하
          "서비스"라 한다)를 이용하는 데 관해 회사와 서비스 이용자(이하
          "회원"이라 한다)의 권리, 의무 및 책임사항을 규정함을 목적으로 합니다.
          <br />
          <br />
          제4조 (회원가입) <br />
          1. 서비스 이용 회원은 갑이 정한 가입 양식에 따라 회원정보를 기입한 후
          이 약관에 동의한다는 의사표시를 함으로서 회원 가입을 신청합니다.{" "}
          <br />
          2. 회원 계약은 회원ID 단위로 체결하며, 갑이 정한 이용약관의 개인정보
          처리방침에 의해 성립됩니다. <br />
          3. 갑은 회원의 정보를 회원계약 시 제시한 개인정보 취급방침이 정한 바에
          따라서만 수집, 이용할 수 있습니다.
          <br />
          <br />
          ※개인정보 처리방침 안내※ <br />
          목적 : 이용자 식별 및 본인 여부 확인 <br />
          항목 : 아이디, 닉네임, 비밀번호 <br />
          보유기간 : 회원탈퇴 시 까지 <br />
          <br />
          제5조 (회원가입의 승낙)
          <br />
          갑의 회원가입 신청 양식에 가입 희망회원이 인터넷으로 제4조와 같이
          신청하면 갑은 바로 가입을 승인하여 서비스를 이용할 수 있습니다.
          <br />
          <br />
          제6조 (강제탈퇴)
          <br />
          회원은 갑의 명예를 훼손시키거나 음란물 등의 불건전한 내용을 게재할
          경우 고지없이 회원의 자격을 강제 박탈 후 탈퇴 시킬 수 있습니다.
          <br />
          <br />
          제7조 (서비스 제공의 중지)
          <br />
          갑은 다음 각호의 1에 해당하는 경우 서비스의 제공을 중지할 수 있습니다.
          <br />
          1. 설비의 보수 등을 위하여 부득이한 경우
          <br />
          2. 전기통신사업법에 규정된 기간통신사업자가 전기통신서비스를 중지하는
          경우
          <br />
          3. 기타 갑이 서비스를 제공할 수 없는 사유가 발생한 경우
          <br />
          <br />
          제8조 (갑의 의무) <br />
          1. 갑은 계속적, 안정적으로 서비스를 제공할 수 있도록 최선의 노력을
          다하여야 합니다. <br />
          2. 갑은 항상 회원의 개인신상정보의 보안에 대하여 관리에 만전을
          기함으로서 회원의 정보보안에 최선을 다하여야 합니다.
          <br /> <br />
          제9조 (개인정보보호) <br />
          1.갑은 이용자의 정보수집시 서비스의 제공에 필요한 최소한의 정보를
          수집합니다.
          <br />
          2.제공된 개인정보는 당해 이용자의 동의없이 목적외의 이용이나 제3자에게
          제공할 수 없으며, 이에 대한 모든 책임은 갑이 집니다. 다만, 다음의
          경우에는 예외로 합니다.
          <br /> ①통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서 특정
          개인을 식별할 수 없는 형태로 제공하는 경우
          <br />
          ②전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우
          <br />
          ③범죄에 대한 수사상의 목적이 있거나 정보통신윤리 위원회의 요청이 있는
          경우 <br />
          ④기타 관계법령에서 정한 절차에 따른 요청이 있는 경우 <br />
          3.회원은 언제든지 갑이 가지고 있는 자신의 개인정보에 대해 열람 및
          오류정정을 요구할 수 있으며 갑은 이에 대해 지체없이 처리합니다. <br />
          <br />
          제10조 (회원의 의무) <br />
          1.회원은 관계법령, 이 약관의 규정, 이용안내 및 주의사항 등 갑이
          통지하는 사항을 준수하여야 하며, 기타 갑의 업무에 방해되는 행위를
          하여서는 안됩니다. <br />
          2.회원은 갑의 사전 승낙 없이 서비스를 이용하여 어떠한 영리 행위도 할
          수 없습니다.
          <br /> 3.회원은 서비스를 이용하여 얻은 정보를 갑의 사전 승낙 없이
          복사, 복제, 변경, 번역, 출판,방송 기타의 방법으로 사용하거나 이를
          타인에게 제공할 수 없습니다.
          <br /> 4.회원은 이용신청서의 기재내용 중 변경된 내용이 있는 경우
          서비스를 통하여 그 내용을 갑에게 통지하여야 합니다.
          <br /> 5.회원은 서비스 이용과 관련하여 다음 각 호의 행위를 하여서는
          안됩니다.
          <br /> ①다른 회원의 아이디(ID)를 부정 사용하는 행위
          <br /> ②범죄행위를 목적으로 하거나 기타 범죄행위와 관련된 행위
          <br /> ③선량한 풍속, 기타 사회질서를 해하는 행위
          <br /> ④타인의 명예를 훼손하거나 모욕하는 행위
          <br /> ⑤타인의 지적재산권 등의 권리를 침해하는 행위
          <br /> ⑥해킹행위 또는 컴퓨터바이러스의 유포행위
          <br /> ⑦타인의 의사에 반하여 광고성 정보 등 일정한 내용을 지속적으로
          전송 또는 타 사이트를 링크하는 행위
          <br /> ⑧서비스의 안전적인 운영에 지장을 주거나 줄 우려가 있는 일체의
          행위
          <br /> ⑨기타 관계법령에 위배되는 행위
          <br /> ⑩게시판 등 커뮤니티를 통한 상업적 광고홍보 또는 상거래 행위
          <br />
          <br />
          제11조 (게시물 또는 내용물의 삭제)
          <br /> 갑은 서비스의 게시물 또는 내용물이 제10조의 규정에 위반되는경우
          사전 통지나 동의 없이 이를 삭제할 수 있습니다.
          <br />
          <br /> 제12조 (게시물에 대한 권리·의무) 게시물에 대한 저작권을 포함한
          모든 권리 및 책임은 이를 게시한 회원에게 있습니다.
          <br />
          <br /> 제13조 (양도금지) 회원이 서비스의 이용권한, 기타 이용계약상
          지위를 타인에게 양도, 증여할 수 없으며, 이를 담보로 제공할 수
          없습니다.
          <br />
          <br /> 제14조 (면책·배상) <br />
          1.갑은 회원이 서비스에 게재한 정보, 자료, 사실의 정확성, 신뢰성 등 그
          내용에 관하여는 어떠한 책임을 부담하지 아니하고, 회원은 자기의
          책임아래 서비스를 이용하며, 서비스를 이용하여 게시 또는 전송한 자료
          등에 관하여 손해가 발생하거나 자료의 취사 선택, 기타서비스 이용과
          관련하여 어떠한 불이익이 발생 하더라도 이에 대한 모든 책임은 회원에게
          있습니다.
          <br />
          2.'갑'은 제10조의 규정에 위반하여 회원간 또는 회원과 제3자간에
          서비스를 매개로 하여 물품거래 등과 관련하여 어떠한 책임도 부담하지
          아니하고, 회원이 서비스의 이용과 관련하여 기대하는 이익에 관하여
          책임을 부담하지 않습니다.
          <br /> 3.회원 아이디(ID)와 비밀번호의 관리 및 이용상의 부주의로 인하여
          발생 되는 손해 또는 제3자에 의한 부정사용 등에 대한 책임은 모두
          회원에게 있습니다.
          <br /> 4.회원이 제10조, 기타 이 약관의 규정을 위반함으로 인하여 갑이
          회원 또는 제3자에 대하여 책임을 부담하게 되고, 이로써 갑에게 손해가
          발생하게 되는 경우, 이 약관을 위반한 회원은 갑에게 발생하는 모든
          손해를 배상하여야 하며, 동 손해로부터 갑을 면책시켜야 합니다.
          <br />
          <br />
          제15조 (분쟁의 해결)
          <br />
          1.갑과 회원은 서비스와 관련하여 발생한 분쟁을 원만하게 해결하기 위하여
          필요한 모든 노력을 하여야 합니다.
          <br /> 2.1항의 규정에도 불구하고 분쟁으로 인하여 소송이 제기될 경우
          소송은 '갑'의 소재지를 관할하는 법원의 관할로 합니다. <br />
          <br />부 칙 <br />제 1 조 (시행일) 이 약관은 2022년 3월 23일부터 시행합니다.
        </Policy>
      </Content>
    </>
  );
}

const Content = styled(FlexGrid)`
  padding: 30px;
  width: 300px;
  max-width: 300px;
  height: 100%;
  max-height: 600px;
  overflow: scroll;
`;

const Policy = styled.div`
  white-space: pre-wrap;
  word-break: break-all;
`;

export default MemberPolicy;
